{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_vgg16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 512], "dtype": "float32", "sparse": false, "name": "input_vgg16"}, "inbound_nodes": []}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_vgg16", 0, 0, {}]]]}, {"name": "dense_1_bbox", "class_name": "Dense", "config": {"name": "dense_1_bbox", "trainable": true, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_1_cls", "class_name": "Dense", "config": {"name": "dense_1_cls", "trainable": true, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "drop_1_bbox", "class_name": "Dropout", "config": {"name": "drop_1_bbox", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_1_bbox", 0, 0, {}]]]}, {"name": "drop_1_cls", "class_name": "Dropout", "config": {"name": "drop_1_cls", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_1_cls", 0, 0, {}]]]}, {"name": "dense_2_bbox", "class_name": "Dense", "config": {"name": "dense_2_bbox", "trainable": true, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_1_bbox", 0, 0, {}]]]}, {"name": "dense_1_attr", "class_name": "Dense", "config": {"name": "dense_1_attr", "trainable": true, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2_cls", "class_name": "Dense", "config": {"name": "dense_2_cls", "trainable": true, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_1_cls", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_2_bbox", 0, 0, {}], ["dense_1_attr", 0, 0, {}], ["dense_2_cls", 0, 0, {}]]]}, {"name": "drop_merge", "class_name": "Dropout", "config": {"name": "drop_merge", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_2_attr", "class_name": "Dense", "config": {"name": "dense_2_attr", "trainable": true, "units": 768, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_merge", 0, 0, {}]]]}, {"name": "drop_2_bbox", "class_name": "Dropout", "config": {"name": "drop_2_bbox", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2_bbox", 0, 0, {}]]]}, {"name": "drop_2_attr", "class_name": "Dropout", "config": {"name": "drop_2_attr", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2_attr", 0, 0, {}]]]}, {"name": "drop_2_cls", "class_name": "Dropout", "config": {"name": "drop_2_cls", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2_cls", 0, 0, {}]]]}, {"name": "predictions_bbox", "class_name": "Dense", "config": {"name": "predictions_bbox", "trainable": true, "units": 4, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_2_bbox", 0, 0, {}]]]}, {"name": "predictions_attr", "class_name": "Dense", "config": {"name": "predictions_attr", "trainable": true, "units": 200, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_2_attr", 0, 0, {}]]]}, {"name": "predictions_class", "class_name": "Dense", "config": {"name": "predictions_class", "trainable": true, "units": 35, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop_2_cls", 0, 0, {}]]]}], "input_layers": [["input_vgg16", 0, 0]], "output_layers": [["predictions_bbox", 0, 0], ["predictions_attr", 0, 0], ["predictions_class", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}